# 2602446: Quiz 1 (50 points)
### วันสอบ 30-Sep-2020 เวลา 9:00-11:30
### รหัสนิสิต: <span style="color:darkgreen"></span>
### ชื่อ นามสกุล: <span style="color:darkgreen"></span>

---

## instruction
1. กรอกรหัสนิสิตพร้อมชื่อและนามสุกลในเซลล์แรก
1. ติดตั้งฐานข้อมูล yummi ในเครื่องส่วนตัว หรือใช้จาก host='vdi-t34.acc.chula.ac.th' (user='guest', password='forgetmenot')
    - download yummi.tar ได้ที่ https://github.com/prasertcbs/postgresql/raw/master/yummi.tar
1. ตั้งชื่อไฟล์โดยใช้รหัสนิสิต (ห้ามมีช่องว่าง) ตามด้วย quiz1 เช่น <span style="color:red">6141234526quiz1.ipynb</span>
1. ในแต่ละข้อให้เขียนชุดคำสั่งสืบค้นข้อมูลเพียงเซลล์เดียวเท่านั้น
1. ส่งไฟล์ไปยัง google classroom ภายใน 11:35 น. (ส่งสายหักนาทีละ 5 คะแนน)

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
from glob import glob

# conda install sqlalchemy, psycopg2
from sqlalchemy import create_engine

# pip install psycopg2-binary -U
import psycopg2

from tqdm import tqdm, trange

%matplotlib inline
%config InlineBackend.figure_format='retina'

In [2]:
#### magic command (%)
%load_ext sql

import getpass
from sqlalchemy import create_engine
# host='localhost'
host='localhost'
port=5432

user=getpass.getpass('user: ')
pwd=getpass.getpass('password: ')

# create connection to yummi
dbname='yummi'
connection_string=f'postgresql+psycopg2://{user}:{pwd}@{host}:{port}/{dbname}' # for %sql magic
%sql $connection_string
con1=create_engine(connection_string) # for sqlalchemy

# create connection to disney
# dbname='disney'
# connection_string=f'postgresql+psycopg2://{user}:{pwd}@{host}:{port}/{dbname}' # for %sql magic
# %sql $connection_string

# %config SqlMagic.autopandas = True

# con2=create_engine(connection_string) # for sqlalchemy

# con=con1

user:  ········
password:  ·············

In [3]:
import socket
hostname = socket.gethostname()
ip_address = socket.gethostbyname(hostname)
print(f"Hostname: {hostname}")
print(f"IP Address: {ip_address}")

print(pd.Timestamp.now())

Hostname: Guy.local
IP Address: 127.0.0.1
2021-07-13 19:44:24.175099

# yummi database

In [4]:
%sql postgres@yummi
# %sql postgres@yummi

## 1. (15 คะแนน) สร้างคำสั่งสืบค้นข้อมูลเพื่อแสดงวันที่ขายดีที่สุดในแต่ละเดือน (OrderHdr.Netpay) ของปี 2003
```
+-------+------------+---------+----------------+
| month |    date    | dayname |    revenue     |
+-------+------------+---------+----------------+
|   1   | 2003-01-10 |   Fri   |      10,775.75 |
|   2   | 2003-02-01 |   Sat   |      12,094.75 |
|   3   | 2003-03-08 |   Sat   |       9,399.00 |
|   4   | 2003-04-25 |   Fri   |      10,668.00 |
|   5   | 2003-05-16 |   Fri   |      10,513.00 |
|   6   | 2003-06-21 |   Sat   |      10,601.25 |
|   7   | 2003-07-13 |   Sun   |       7,382.25 |
|   8   | 2003-08-03 |   Sun   |       7,666.00 |
|   9   | 2003-09-12 |   Fri   |      11,400.25 |
|   10  | 2003-10-24 |   Fri   |       8,336.50 |
|   11  | 2003-11-22 |   Sat   |      11,452.00 |
|   12  | 2003-12-06 |   Sat   |       9,357.25 |
+-------+------------+---------+----------------+
```

In [5]:
%%sql 
with cte as ( 
    select extract(month from intime)::int "month", intime::date "date", 
        to_char(intime,'Dy') "dayname", to_char(sum(netpay),'999,999.99') revenue
    from orderhdr
    where extract(year from intime)=2003 and extract(dow from intime) in (0,5,6)
    group by month, dayname, date
), cte2 as (
select *, rank() over(partition by month order by revenue desc) from cte
) 
select month, date, dayname, revenue from cte2
        where rank = 1
    group by month, date, dayname, revenue

 * postgresql+psycopg2://postgres:***@localhost:5432/yummi
12 rows affected.

[(1, datetime.date(2003, 1, 10), 'Fri', '  10,775.75'),
 (2, datetime.date(2003, 2, 1), 'Sat', '  12,094.75'),
 (3, datetime.date(2003, 3, 8), 'Sat', '   9,399.00'),
 (4, datetime.date(2003, 4, 25), 'Fri', '  10,668.00'),
 (5, datetime.date(2003, 5, 16), 'Fri', '  10,513.00'),
 (6, datetime.date(2003, 6, 21), 'Sat', '  10,601.25'),
 (7, datetime.date(2003, 7, 13), 'Sun', '   7,382.25'),
 (8, datetime.date(2003, 8, 3), 'Sun', '   7,666.00'),
 (9, datetime.date(2003, 9, 12), 'Fri', '  11,400.25'),
 (10, datetime.date(2003, 10, 24), 'Fri', '   8,336.50'),
 (11, datetime.date(2003, 11, 22), 'Sat', '  11,452.00'),
 (12, datetime.date(2003, 12, 6), 'Sat', '   9,357.25')]

---

## 2. (15 คะแนน) อาหารที่ขายดีที่สุดในแต่ละหมวด (นับตามจำนวนครั้งของการสั่ง)
```
+-----------+-----------------------+----------+
|  category |         descr         |  orders  |
+-----------+-----------------------+----------+
| Appetizer |       Fish Cake       |    2,014 |
|  Beverage |       Pure Water      |    6,407 |
|  Dessert  |   Coconut Ice Cream   |    1,422 |
|    Dish   | Tom Yum Kung (Medium) |    6,569 |
|  Menu Set |       Dinner Set      |    1,413 |
|   total   |                       |   17,825 |
+-----------+-----------------------+----------+
```

In [8]:
%%sql
with cte as (
    select c.descr "category", m.descr "descr", menuid
    from category c inner join menu m using(categoryid)
    group by category, m.descr, menuid
), cte2 as (
select category, descr, sum(qty) orders
    from cte inner join ordermenudtl using(menuid)
    group by category, descr
),
cte3 as (
    select *, rank() over(partition by category order by orders desc) rank from cte2
) 
select category, descr, orders from cte3 
    where rank = 1
    group by category, descr, orders
union
select 'total', ' ', sum(orders) over() from cte3
    where rank = 1

 * postgresql+psycopg2://postgres:***@localhost:5432/yummi
6 rows affected.

[('Appetizer', 'Fish Cake', Decimal('2014')),
 ('Beverage', 'Pure Water', Decimal('6407')),
 ('Dessert', 'Coconut Ice Cream', Decimal('1422')),
 ('Dish', 'Tom Yum Kung (Medium)', Decimal('6569')),
 ('Menu Set', 'Dinner Set', Decimal('1413')),
 ('total', ' ', Decimal('17825'))]

---

## 3. (20 คะแนน) สรุปจำนวนครั้งการสั่งอาหารในแต่ละหมวดแยกตามไตรมาสของปี 2002
```
+-----------+---------+---------+---------+---------+---------+
|  category |    Q1   |    Q2   |    Q3   |    Q4   |  total  |
+-----------+---------+---------+---------+---------+---------+
| Appetizer |     593 |     739 |     703 |     554 |   2,589 |
|  Beverage |   1,355 |   1,669 |   1,448 |   1,390 |   5,862 |
|  Dessert  |     338 |     443 |     410 |     348 |   1,539 |
|    Dish   |   1,643 |   2,154 |   1,978 |   1,764 |   7,539 |
|  Menu Set |     279 |     460 |     374 |     382 |   1,495 |
|   total   |   4,208 |   5,465 |   4,913 |   4,438 |  19,024 |
+-----------+---------+---------+---------+---------+---------+
```

In [6]:
%%sql    
with cte as (
    select c.descr "category", sum(qty) as "Q1"
    from category c inner join menu using(categoryid) inner join ordermenudtl using(menuid)
    inner join orderhdr using(orderid) 
    where extract(quarter from intime)=1 and extract(year from intime)=2002
    group by "category"
), cte2 as (
    select c.descr "category", sum(qty) as "Q2"
    from category c inner join menu using(categoryid) inner join ordermenudtl using(menuid)
    inner join orderhdr using(orderid) 
    where extract(quarter from intime)=2 and extract(year from intime)=2002
    group by "category"
), cte3 as (
    select c.descr "category", sum(qty) as "Q3"
    from category c inner join menu using(categoryid) inner join ordermenudtl using(menuid)
    inner join orderhdr using(orderid) 
    where extract(quarter from intime)=3 and extract(year from intime)=2002
    group by "category"
), cte4 as (
    select c.descr "category", sum(qty) as "Q4"
    from category c inner join menu using(categoryid) inner join ordermenudtl using(menuid)
    inner join orderhdr using(orderid) 
    where extract(quarter from intime)=4 and extract(year from intime)=2002
    group by "category"
)
select category, "Q1", "Q2", "Q3", "Q4", sum("Q1"+"Q2"+"Q3"+"Q4") total
    from cte inner join cte2 using(category) 
    inner join cte3 using(category) inner join cte4 using(category)
    group by category, "Q1", "Q2", "Q3", "Q4"
union
select 'total', sum("Q1") over(), sum("Q2") over(), sum("Q3") over(), sum("Q4") over(),
    sum("Q1"+"Q2"+"Q3"+"Q4") over() from cte inner join cte2 using(category) 
    inner join cte3 using(category) inner join cte4 using(category)

 * postgresql+psycopg2://postgres:***@localhost:5432/yummi
6 rows affected.

[('Appetizer', Decimal('593'), Decimal('739'), Decimal('703'), Decimal('554'), Decimal('2589')),
 ('Beverage', Decimal('1355'), Decimal('1669'), Decimal('1448'), Decimal('1390'), Decimal('5862')),
 ('Dessert', Decimal('338'), Decimal('443'), Decimal('410'), Decimal('348'), Decimal('1539')),
 ('Dish', Decimal('1643'), Decimal('2154'), Decimal('1978'), Decimal('1764'), Decimal('7539')),
 ('Menu Set', Decimal('279'), Decimal('460'), Decimal('374'), Decimal('382'), Decimal('1495')),
 ('total', Decimal('4208'), Decimal('5465'), Decimal('4913'), Decimal('4438'), Decimal('19024'))]

---